<?php
echo "2 + 2 = ", 2 + 2, "<br>"; 
echo "5 - 2 = ", 5 - 2, "<br>"; 
echo "10 * 10 = ", 10 * 10, "<br>"; 
echo "100 / 2 = ", 100 / 2, "<br>"; 
echo "10 % 2 = ", 10 % 2, "<br>";
echo "10 ** 2 = ", 10 ** 2, "<br>";
echo (5 % 3)."\n";
echo (5 % -3)."\n";
echo (-5 % 3)."\n";
echo (-5 % -3)."\n";
echo "round(4.2) = ", round(4.2), "<br>"; 
echo "hypot(3.0,4.0) = ", hypot(3.0,4.0), "<br>";
echo "sin(pi()) = ", sin(pi()), "<br>"; // можно также использовать M_PI
echo "max(3.5,-2.0,6,700) = ", max(3.5,-2.0,6,700), "<br>"; // неограниченное число аргументов 
?>
